# face_direction_index - 얼굴 방향 감지
face_direction_index = [2, 177, 401, 152, 10]

# faceshape landmark index - 얼굴형 인덱스, 윤곽선 드로잉 인덱스
faceshape_landmark_index = [227, 447, 54, 284, 10, 152, 58, 288, 150, 379, 176, 400, 8, 2, 33, 243, 463, 263, 172, 397,
            136, 365, 132, 361]
face_contour_index = [10, 338, 297, 332, 284, 251, 389, 356, 454, 323, 361, 288, 397, 365, 379, 378, 400,
                          377, 152, 148, 176, 149, 150, 136, 172, 58, 132, 93, 234, 127, 162, 21, 54, 103, 67, 109]
# eyeshape & eyebrow landmark index 눈, 눈썹 인덱스
left_eye_index = [263, 466, 388, 387, 386, 385, 384, 398, 362, 382, 381, 380, 374, 373, 390, 249]
right_eye_index = [33, 246, 161, 160, 159, 158, 157, 173, 133, 155, 154, 153, 145, 144, 163, 7]
left_eyebrow_index = [336, 296, 334, 293, 300]
right_eyebrow_index = [107, 66, 105, 63, 70]
FT_INDEX = [227, 447, 33, 133, 362, 263]

# mouthshape landmark index 입 랜드마크 인덱스, 드로잉 인덱스
mouth_index = [0, 13, 14, 17, 61, 291, 267, 312, 191, 415]
mouth_contour_index = [0, 267, 269, 270, 409, 291, 292, 415, 310, 311, 312, 13, 82, 81, 80, 191,
                       62, 95, 88, 178, 87, 14, 317, 402, 318, 324, 291, 375, 321, 405, 314, 17,
                       84, 181, 91, 146, 61, 185, 40, 39, 37]

# noseshape landmark index 얼굴 세로 비율 구하기 위한 얼굴 인덱스, 코 랜드마크 인덱스
face_index = [2, 177, 401, 227, 447, 10, 152]
nose_index = [168, 6, 197, 195, 5, 4, 1, 2,  # 코 중앙 랜드마크(8)
              99, 240, 48, 49, 209, 198, 174, 245,  193, 168, 417, 465, 399, 420, 429, 279, 278 , 460, 328, 2   # 코 모양 랜드마크
                ]
nose_ft_index = [168, 1, 49, 279]


